// Випадкове ціле число від min до max включно:
// var rand = min + Math.floor(Math.random() * (max + 1 - min));
// _____________________________________________________________
// Перевірка на число:
// function isNumeric(n) {
//  return !isNaN(parseFloat(n)) && isFinite(n)
// }
//________________________________________________________________
//Повністю клонувати масив:
//for (var i = 0; i < arr.length; i++) arr2[i] = arr[i];
//_________________________________________________________________
//Сортування масиву чисел:
//function compareNumeric(a, b) {
//  return a - b;
//}
