Випадкове ціле число від min до max включно:
var rand = min + Math.floor(Math.random() * (max + 1 - min));
_______________________________________________________________
Перевірка на число:
function isNumeric(n) {
 return !isNaN(parseFloat(n)) && isFinite(n)
}
________________________________________________________________
Повністю клонувати масив:
for (var i = 0; i < arr.length; i++) arr2[i] = arr[i];
_________________________________________________________________
Сортування масиву чисел:
function compareNumeric(a, b) {
 return a - b;
}
__________________________________________________________________
Видалити елементи з масиву за певної умови:
for (var i = 0; i < arr.length; i++) {
    var val = arr[i];
    if (val < a || val > b) {
      arr.splice(i--, 1);
    }
  }
__________________________________________________________________
Випадовий порядок у масиві:
function sorting() {
    return Math.random() - 0.5;
}
